/******************************************************************************

Последовательность Фибоначчи определяется так:

F(0) = 0, F(1) = 1, …, F(n) = F(n−1) + F(n−2).

По данному числу N определите N-е число Фибоначчи F(N).

Формат входных данных
Вводится натуральное число N.
Формат выходных данных
Выведите ответ на задачу.
Sample Input:

6
Sample Output:

8

*******************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    int N, F = 0, F_1 = 1, cnt = 0, tmp;
    
    cin >> N;
    
    while(cnt < N) {
        tmp = F;
        F += F_1;
        F_1 = tmp;
        cnt++;
    }
    
    cout << F;
    
    return 0;
}
