/******************************************************************************

По данным числам n и m заполните двумерный массив размером n×m числами от 1 до n×m “диагоналями”, как показано в примере.
Формат входных данных
Вводятся два числа n и m, не превышающие 100.

Формат выходных данных
Выведите полученный массив, отводя на вывод каждого элемента ровно 4 символа.

Sample Input:

3 5
Sample Output:

   1   2   4   7  10
   3   5   8  11  13
   6   9  12  14  15

*******************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    int m, n, m_t = 0, cnt = 0, k = 0;
   
    cin >> m >> n;
   
    m_t = m;
   
    int A[m][n];
   
    for(int i = 0; i < m + n - 1; i++) {
        for(int j = ((i < n) ? i : n - 1); j >= ((i < m) ? 0 : i - m + 1); j--) {
            cnt++;
            A[m - m_t - j][j] = cnt;
        }
        m_t--;
    }
   
    for(int i = 0; i < m; i++) {
        for(int j = 0; j < n; j++) {
            int temp = A[i][j];
            while((temp *= 10) < 10000) {
                cout << " ";
            }
            cout << A[i][j];
        }
        cout << endl;
    }
   
    return 0;
}
