/******************************************************************************

Выведите все исходные точки в порядке возрастания их расстояний от начала координат. 

Входные данные

Программа получает на вход набор точек на плоскости. Сначала задано количество точек n, затем идет последовательность из n строк, каждая из которых содержит два числа: координаты точки. Величина n не превосходит 100, все исходные координаты – целые числа, не превосходящие 103.

Выходные данные

Необходимо вывести все исходные точки в порядке возрастания их расстояний от начала координат.

Sample Input:

2
1 2
2 3
Sample Output:

1 2
2 3

*******************************************************************************/

#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

bool comp(pair <int, int> a, pair <int, int> b) {
    return ((b.first * b.first + b.second * b.second) > (a.first * a.first + a.second * a.second));
}

int main()
{
    int n;
    cin >> n;
    vector <pair <int, int>> A(n);
    while(n--) {
        int x, y;
        cin >> x >> y;
        A[n] = {x, y};
    }
    
    sort(A.begin(), A.end(), comp);
    
    for(auto i : A) {
        cout << i.first << " " << i.second << endl;
    }
    
    return 0;
}
