/******************************************************************************

Дано число n, не превосходящее 10, и массив размером n × n. Проверьте, является ли этот массив симметричным относительно главной диагонали. Выведите слово “YES”, если массив симметричный, и слово “NO” в противном случае.

Sample Input:

3
0 1 2
1 2 3
2 3 4
Sample Output:

YES

*******************************************************************************/

#include <iostream>

using namespace std;

int main()
{
    int n, cnt = 0;
    
    cin >> n;
    
    int A[n][n];
    
    for(int i = 0; i < n; i++) {
        for(int j = 0; j < n; j++) {
            cin >> A[i][j];
        }
    }
    
    for(int i = 0; i < n - 1; i++) {
        for(int j = i + 1; j < n; j++) {
            if(A[i][j] == A[j][i]) {
                continue;
            }
            cnt++;
        }
    }
    
    if(!cnt) {
        cout << "YES" << endl;
    } else {
        cout << "NO" << endl;
    }
    
    return 0;
}
