/******************************************************************************
По данным числам n и m заполните двумерный массив размером n×m числами от 1 до n×m по спирали, выходящей из левого верхнего угла и закрученной по часовой стрелке, как показано в примере.
Формат входных данных
Вводятся два числа n и m, не превышающие 100.

Формат выходных данных
Выведите полученный массив, отводя на вывод каждого элемента ровно 4 символа.

Sample Input:

4 5
Sample Output:

   1   2   3   4   5
  14  15  16  17   6
  13  20  19  18   7
  12  11  10   9   8

*******************************************************************************/

#include <iostream>
#include <iomanip>
using namespace std;

int main()
{
    int m, n, cnt = 0, s = 1;
    cin >> m >> n;
    int A[m][n];
    int l, i = 0, j = 0;
    for(int k = 0; k < ((m < n) ? m : n); k++, s = -s) {
        l = k / 2;
        for(j = ((k % 2) ? n - l - 2 : l); j != ((k % 2) ? l - 1: n - l); j += s) {
            //cout << i << "|" << j << " ";
            A[i][j] = ++cnt;
        }
        j -= s;
        //cout << endl;
        for(i = ((k % 2) ? m - 2 - l : l + 1); i != ((k % 2) ? l : m - l); i += s) {
            //cout << i << "|" << j << " ";
            A[i][j] = ++cnt;
        }
        i -= s;
        //cout << endl;
    }
    for(i = 0; i < m; i++) {
        for(j = 0; j < n; j++) {
            cout << setw(4) << A[i][j];
        }
        cout << endl;
    }
    return 0;
}
